[M_YouDontKnowJack MissionDefinition]
MissionDescription="Mordecai said he knew them better than anyone before he killed them. That's why you got kicked out [place]Remedy against dryness[-place] Gather as much data as you can about Handsome Jack's growth."
MissionSummary="Search for the voice of Jack the Great."

[M_YouDontKnowJack:Journal1 MissionObjectiveDefinition]
ProgressMessage="First you get the ECHO socket"

[M_YouDontKnowJack:Journal2 MissionObjectiveDefinition]
ProgressMessage="get another Echo connection"

[M_YouDontKnowJack:Journal3 MissionObjectiveDefinition]
ProgressMessage="Get Jack III in ECHO."

[M_YouDontKnowJack:Journal4 MissionObjectiveDefinition]
ProgressMessage="See ECHO's fourth position."

[M_YouDontKnowJack:Journal5 MissionObjectiveDefinition]
ProgressMessage="Take the fifth hook ECHO"
